hiepnguyen57/stm32f7_micarray/Include/main.h
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H__
#define __MAIN_H__

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"
#include "log.h"
#include "i2c.h"
#include "mic_array.h"
#include "command.h"
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private define ------------------------------------------------------------*/

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
 extern "C" {
#endif
void _Error_Handler(char *, int);

#define Error_Handler() _Error_Handler(__FILE__, __LINE__)
#ifdef __cplusplus
}
#endif

/* Exported Defines ------------------------------------------------------------*/
#ifdef DEBUG
# define logs(msg)      printf("DEBUG: %s\r\n", msg)
#else
# define logs(msg) do {} while (0)
#endif
#ifdef DEBUG
# define logs_error(fmt)      printf("Fnc:%s, line:%d; ERROR: %s\r\n", \
                                    __FUNCTION__, __LINE__, fmt)
#else
# define logs_error(fmt) do {} while (0)
#endif

#define CPU_OUTPUT_PIN               GPIO_PIN_3
#define CPU_OUTPUT_GPIO_PORT         GPIOD
#define CPU_OUTPUT_GPIO_CLK_ENABLE() __HAL_RCC_GPIOD_CLK_ENABLE()

#define CPU_INPUT_PIN               GPIO_PIN_2
#define CPU_INPUT_GPIO_PORT         GPIOD
#define CPU_INPUT_GPIO_CLK_ENABLE() __HAL_RCC_GPIOD_CLK_ENABLE()

#define PWR_LEDRING_PIN               GPIO_PIN_14
#define PWR_LEDRING_GPIO_PORT         GPIOE
#define PWR_LEDRING_GPIO_CLK_ENABLE() __HAL_RCC_GPIOE_CLK_ENABLE()

#define CY8C_RESET_PIN                GPIO_PIN_1
#define CY8C_RESET_GPIO_PORT          GPIOB
#define CY8C_RESET_GPIO_CLK_ENABLE()  __HAL_RCC_GPIOB_CLK_ENABLE()

#define CY8C_LED1_PIN                 GPIO_PIN_0
#define CY8C_LED2_PIN                 GPIO_PIN_1
#define CY8C_LED3_PIN                 GPIO_PIN_2
#define CY8C_LED4_PIN                 GPIO_PIN_3
#define CY8C_PROX_LED_PIN             GPIO_PIN_4
#define CY8C_LED_GPIO_PORT            GPIOG
#define CY8C_LED_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOG_CLK_ENABLE()
//export function
void OUPUT_PIN_GENERATE_PULSE(void);
void LEDx_OnOff(uint16_t led, uint8_t state);

#endif /* __MAIN_H__ */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
